{ 
  "post1": {
    "id": 7,
    "category": "Hiring",
    "title": "Outsourcing vs Outstaffing, which is right for you?",
    "image": "https://geriasa.blob.core.windows.net/assets/yes_55e2aeb830.jpg",
    "previewText": "The growing wave of digitization and digitalization has resulted in a critical talent gap in the UK. If not addressed, much of the potential of digitalization could go unrealized. According to Consultancy.uk, the UK stands the risk of forgoing more than £140 billion if the status quo remains. Let’s start with the definition of these terms.In the simplest form, outsourcing happens when a company hires another company to carry out planned or existing business activity. In the technology space, this often takes the form of software development",
    "longText": "<p>The growing wave of digitization and digitalization has resulted in a critical talent gap in the UK. If not addressed, much of the potential of digitalization could go unrealized.</p><p>According to <a href=\"https://www.consultancy.uk/\" target=\"_blank\" style=\"color: blue;\">Consultancy.uk</a>, the UK stands the risk of forgoing more than £140 billion if the status quo remains.</p><p>Let’s start with the definition of these terms.</p><br><h5>Outsourcing</h5><p>In the simplest form, outsourcing happens when a company hires another company to carry out planned or existing business activity. In the technology space, this often takes the form of software development. Here, your vendor bears the responsibility of delivering the project and manages the end-to-end project flow. When finished, the product is delivered to you, tested and approved.</p><br><h5>Outstaffing</h5><p>Here, you hire an individual or a team of professionals to work as embedded members of your team under your supervision. In most cases, they work remotely. You have full control here and determine the work flow direction. The outstaffing vendor takes the critical role of finding, hiring, and handling all administrative duties. While the employee’s payroll and taxes are handled by your vendor, the employee works directly with you.</p><br><h5>Cost</h5><p>Smart organizations often look for ways of remaining competitive, especially in periods of uncertainty and instability, like the imminent recession is about to plunge us into. Organizations are increasingly turning to these models to utilize available resources optimally and reduce cost.</p><br><h5>Remote mindset</h5><p>The global pandemic has accelerated our transition to remote work. Research studies show a positive correlation between remote work and productivity, indicating that organizations are likely to maintain the remote culture after the global lockdown due to the inherent advantages.</p><br><h5>Benefits of outsourcing and Outstaffing</h5><p><strong>Cost savings</strong></p><p>Outsourcing to a country with lower cost of living translates to significant cost savings. Lower salaries, production, infrastructure, and operational costs mean the vendor will charge much less than another vendor in high-cost markets.</p><p><strong>Time savings</strong></p><p>With an outsourcing partner, you don’t waste time in hiring, onboarding, and training new staff members. You simply hire the vendor, who uses his existing, often experienced team to deliver your project. As you know, time is money.</p><p><strong>Scaling fast</strong></p><p>When you outsource some or all elements of your development, you free up time to focus on acquiring new clients and entering new markets, without scaling your internal operation.</p><p><strong>Access to global talent pool</strong></p><p>With the increasing shortage in tech talents in the UK, outsourcing and outstaffing models are a strategy to access the hard-to-find and expensive skills set in the local market. In addition, employing the outsourcing model increases your organization’s diversity quotient.</p><br><h5>Concerns of outsourcing</h5><p><strong>Time difference</strong></p><p>This can be a major challenge if you are not in similar time zones with your outsourcing vendor. There could be a significant dent in the communication flow which could affect the overall success of the project.</p><p><strong>Language barrier</strong></p><p>Communication flow could be hampered significantly if your partner vendor struggles with your major language of communication. This often leads to wasted time and misinterpretation of the project requirements.</p><p><strong>Culture and work habits</strong></p><p>Different environments elicit different cultural norms and work habits. For example, for some hierarchical cultures, reports often do the bidding of the superiors, with no questions asked. Training and retraining go a long way in filling the missing gaps here.</p><p><strong>Privacy and security concerns</strong></p><p>From afar, this may look like a huge concern. On a close look, one discovers that the challenges can easily be mitigated. With the outstaffing model, the contracting company has total control on the access granted to the embedded staff just as other staff members. Also, engagements on the outsourcing model typically come with intellectual property protection.</p></br><h5>What option do I go for?</h5><p>Outstaffing model is ideal in situations where you have the required expertise in-house but lack the development capacity. You may have a CTO, who is responsible for your development strategy and is particular about the architectural consistency of your software component but needs some additional hands. To overcome the capacity challenge, you could either go for an embedded team member or a team extension — depending on the capacity gap.</p><p>Outsourcing is better suited for situations where you do not have the in-house expertise and are not able to build your IT team yet either due to a constrained budget or other reasons. In this case, you could have a measurable part or your entire project built out by the outsourced vendor.</p><p>If you are looking for a partner that understands how to recruit and onboard overseas talents for full-time or part-time positions, hit us up at Geria. We take care of all the recruitment and overhead responsibilities and ensure the right candidate is embedded into your team while you focus on building that awesome product!</p><p>Photo credit: skydiv</p>",
    "date": "Tue. 28th Nov. 2023.",
    "authorName": "Sophie Wood",
    "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
  },

  "posts": [
    {
      "id": 1,
      "category": "Build",
      "title": "How to improve the learning culture within your team",
      "image": "https://geriasa.blob.core.windows.net/assets/How_to_improve_the_learning_culture_within_your_team_1_min_4a5403b310.jpg",
      "previewText": "As the saying goes, \"teamwork makes the dream work\". And one of the essential aspects of effective teamwork is a healthy learning culture within the team. A learning culture is a set of values, behaviors, and practices that encourage individuals and teams to continuously learn and develop. Building a culture of learning within your team can lead to improved performance, increased job satisfaction, and better overall outcomes. In this blog, we'll discuss some practical ways to improve the learning culture within your team",
      "longText": "<p>As the saying goes, \"teamwork makes the dream work\". And one of the essential aspects of effective teamwork is a healthy learning culture within the team. A learning culture is a set of values, behaviors, and practices that encourage individuals and teams to continuously learn and develop. Building a culture of learning within your team can lead to improved performance, increased job satisfaction, and better overall outcomes. In this blog, we'll discuss some practical ways to improve the learning culture within your team.<br><br></p><br><h5>Encourage Continuous Learning</h5><p>Encouraging continuous learning is the first step towards building a culture of learning within your team. Encourage your team members to attend conferences, workshops, or training sessions that align with their job roles. Additionally, you can provide access to online learning platforms or courses that cater to their areas of interest or skill gaps. Continuous learning helps team members stay updated with the latest industry trends, best practices, and technologies.</p><br><h5>Promote Knowledge Sharing</h5><p>Creating a knowledge-sharing culture is crucial to improve the learning culture within your team. Encourage your team members to share their knowledge, expertise, and experiences with each other. This can be done through regular team meetings, informal discussions, or cross-functional projects. It creates a sense of collaboration and trust among team members, which can lead to better outcomes.</p><br><h5>Set Learning Goals</h5><p>Setting learning goals is an effective way to encourage team members to take ownership of their learning and development. Sit down with each team member and discuss their learning goals. Based on their goals, identify the skills or knowledge they need to acquire or develop. Once the goals are set, ensure that they have access to the necessary resources and support to achieve them. Monitor their progress regularly and celebrate their achievements.</p><br><h5>Recognize and Reward Learning</h5><p>Recognizing and rewarding learning can motivate team members to embrace a culture of learning. Celebrate their achievements and provide feedback on their progress. Recognize team members who share their knowledge or take initiative to learn something new. Provide opportunities for team members to apply their new knowledge or skills and share the results with the team.</p><br><h5>Lead by Example</h5><p>As a team leader, you play a critical role in shaping the learning culture within your team. Lead by example and demonstrate a commitment to learning and development. Attend training sessions, share your knowledge and experiences, and encourage feedback from team members. Celebrate your team members' achievements and encourage them to take ownership of their learning and development.</p><br><p>In conclusion, building a culture of learning within your team requires a conscious effort and a commitment to continuous improvement. Encourage continuous learning, promote knowledge sharing, set learning goals, recognize and reward learning, and lead by example. By doing so, you can create a team of lifelong learners who are motivated, engaged, and ready to take on any challenge.</p>",
      "date": "Tue. 7th Oct. 2023.",
      "authorName": "Sophie Wood",
      "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
    }   
  ,    
  {
    "id": 2,
    "category": "Remote Work",
    "title": "A Guide To Remote Workforce Management",
    "image": "https://geriasa.blob.core.windows.net/assets/A_Guide_To_Remote_Workforce_Management_1_min_8f08fe2d95.jpg",
    "previewText": "Everyone wants to work remotely. It’s a millennial-driven trend and a growing movement. Remote work is fast becoming a new normal, driven by greater adoption of virtual collaboration tools and mobile devices, as well as changing work culture that values flexibility and balance and it’s a great way to attract top talent. Nevertheless, remote work is not without its challenges.  It requires hiring people you won’t be able to see every day, which means you need to find another way to manage them effectively without sacrificing productivity or quality of work.",
    "longText": "<p><h5>Introduction</h5></p><p>Everyone wants to work remotely. It’s a millennial-driven trend and a growing movement. Remote work is fast becoming a new normal, driven by greater adoption of virtual collaboration tools and mobile devices, as well as changing work culture that values flexibility and balance and it’s a great way to attract top talent. Nevertheless, remote work is not without its challenges.  It requires hiring people you won’t be able to see every day, which means you need to find another way to manage them effectively without sacrificing productivity or quality of work.</p><br><h5>What is remote workforce management?</h5><p>Remote workforce management can be a smooth and productive experience that makes your company more efficient, lowers costs, and creates happier employees. It is the set of processes and systems used to manage an employee who works remotely. It involves all the different tools, strategies, and techniques you use as an employer to keep tabs on how your remote workers are performing, what they are working on, where they are working from, and how often they are working.</p><p>To manage remote workers effectively, businesses need to implement a remote workforce management system (WFMS). This type of system optimizes processes, automates routine tasks, and standardizes policies related to telework. A WFMS can help your organization reduce costs associated with employee travel, improve security measures for employees working from home, monitor adherence to company policies around telework, and streamline onboarding processes for new hires who will be working from outside the office.</p><p>This remote workforce management guide will give you an introduction to this emerging field as well as tools and tips on how to implement it effectively as part of your company’s operations strategy.</p><br><h5>Recruiting remote talent for your company</h5><p>Remote work isn’t right for everyone, so be sure to carefully screen your candidates and select people who will be comfortable working remotely. When screening candidates, include their feelings about remote work as part of the interview process. Ideally, you’ll want to ask if they have any experience with remote work and if they feel comfortable with it. If not, you can address potential concerns about remote work and let candidates know about the benefits of being able to work remotely. You should also ask candidates about their availability. Find out if they have dependents or other factors that might prevent them from working certain hours or days. Using platforms like Geria, you can build an effective distributed remote workforce.</p><br><h5>Remote employee onboarding</h5><p>New hires will need a little extra help getting oriented to your company’s work structure system. To make the transition easier, you can put together an onboarding program for new hires. The onboarding program helps new hires settle into their new roles and work with ease. It can be tailored to the role a new hire is taking on so that he or she knows exactly what is expected of them and what they need to do to get started. Depending on the type of work your new hires will be doing, you may need to put together an additional training program. For example, if your remote workers are customer service representatives, they’ll need to be trained on how to handle customer complaints effectively.</p><br><h5>Establish your company culture and expectations</h5><p>When you’re managing remote workers, you need to make sure they feel welcome and part of the team. One of the best ways to do this is to create a company culture that extends beyond the office and into workers’ other interests. It is a good idea to clearly state your company values from the start to help them understand what you expect from them. Onboarding programmes are effective ways to help new hires feel comfortable and welcome in the company as well as familiarize them with your remote work policy. You can also use communication channels like video calls and chat apps to make sure they feel just as connected to the team as their in-office colleagues. Let remote workers know they can also participate in office events like off-site meetings through virtual collaboration tools as well as take advantage of other perks that let them feel like part of the team.</p><p>Tips For Effective Remote Workforce Management</p><p>As you manage your remote workers, keep the following tips in mind:</p><ol><li>Be clear about your expectations - Your remote workers won’t be able to read your mind, so make sure they know what you expect of them. Give them timelines for projects and let them know when they’re doing a good job. You can use project management tools like: Asana, Jira, Trello, Slack and more to achieve this goal.</li><li>Be transparent - Make sure your remote workers know how the company is doing, including its financial health and corporate goals. This will help them feel invested in the company and motivated to do their best work.</li><li>Create effective communication channels - Make sure your remote workers have the tools they need to communicate effectively with coworkers and clients. If you use text or video chat apps, make sure everyone has each other’s contact information in case a problem arises. Some tools like; Microsoft teams, Zoom, Google meet can come in handy.</li><li>Manage remote workers like employees - You’ll need to put in a little extra effort when managing your remote workers at first, but it’ll be worth it in the long run. Remember that remote workers are just as valuable as in-office employees, and treat them as such.</li></ol><p>How to Become a Successful Manager</p><p>By this point, you have the right level of knowledge to become a successful manager of a remote workforce. However, implementing the tips and strategies you’ve read about will be easier if you follow these three simple steps:</p><ol><li>Assess your situation - First, assess your situation and make sure you’re ready to manage a remote workforce. Make sure your existing employees will be comfortable working remotely, and select candidates who will be able to thrive in a remote work environment.</li><li>Find the right tools - Next, find the right tools for managing your remote workers. Look for collaboration tools that will help you stay connected to your remote workers, and put together a remote onboarding program to make sure new hires are comfortable and productive from day one.</li><li>Stay consistent - Finally, stay consistent with your remote workforce management strategy. Remote workers can be easily overwhelmed, so don’t expect them to be just as productive as in-office employees.</li></ol><p>Top effective tools for managing remote workers</p>"
    ,"date": "Wed. 8th Oct. 2023.",
    "authorName": "Sophie Wood",
    "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
  }
,
{
  "id": 3,
  "category": "Hiring",
  "title": "Clearing the channel of communication within your team",
  "image": "https://geriasa.blob.core.windows.net/assets/5_reasons_you_should_look_to_a_recruiter_for_your_next_job_1_min_341949e233.jpg",
  "previewText": "Effective communication is the foundation of any successful team. Whether you're working on a project or managing a team, it's essential to have open channels of communication that allow for collaboration, feedback, and problem-solving. However, communication breakdowns can occur when team members don't understand each other, misinterpret messages, or fail to communicate clearly.",
  "longText": "<p>Effective communication is the foundation of any successful team. Whether you're working on a project or managing a team, it's essential to have open channels of communication that allow for collaboration, feedback, and problem-solving. However, communication breakdowns can occur when team members don't understand each other, misinterpret messages, or fail to communicate clearly. In this blog post, we'll discuss some strategies for clearing the channel of communication within your team.</p><h5>Create a communication plan</h5><p>The first step in clearing the channel of communication is to create a communication plan. This plan should outline the team's communication expectations, including how often and in what format team members will communicate with each other. For example, you might set up weekly team meetings, daily check-ins, or regular email updates. Having a clear communication plan ensures that everyone is on the same page and knows what to expect.</p><h5>Use a common language</h5><p>Misunderstandings can often arise when team members are using different terminology or jargon. To clear the channel of communication, it's important to establish a common language that everyone can understand. This might involve defining key terms or acronyms, creating a glossary of terms, or providing training or resources to help team members become familiar with new concepts.</p><h5>Encourage feedback</h5><p>Effective communication is a two-way street. Encouraging feedback from team members can help to identify communication breakdowns and provide opportunities for improvement. Encourage team members to share their thoughts and opinions openly and honestly, and be sure to listen carefully to what they have to say. Providing regular feedback can also help to build trust and improve communication within the team.</p><h5>Use the right communication tools</h5><p>In today's digital age, there are a plethora of communication tools available to teams. From email and instant messaging to video conferencing and project management software, it's important to use the right tools for your team's needs. When choosing communication tools, consider factors such as ease of use, accessibility, and security.</p><h5>Be clear and concise</h5><p>Clear and concise communication is essential for avoiding misunderstandings and improving team productivity. When communicating with team members, be sure to use simple, straightforward language and avoid using overly technical or complicated terms. Make sure that your message is clear and that you have provided all the necessary information.</p><h5>Address communication breakdowns promptly</h5><p>No matter how well-planned your communication strategy is, breakdowns can still occur. When they do, it's important to address them promptly to prevent them from escalating into larger problems. Encourage team members to communicate any issues or concerns they may have and work together to find a solution that works for everyone.</p><p>In conclusion, effective communication is key to the success of any team. By creating a communication plan, using a common language, encouraging feedback, using the right communication tools, being clear and concise, and addressing breakdowns promptly, you can clear the channel of communication within your team and improve productivity, morale, and results.</p>",
  "date": "Thur. 9th Oct. 2023.",
  "authorName": "Sophie Wood",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
}
,
{
  "id": 4,
  "category": "Remote Work",
  "title": "The future of work",
  "image": "https://geriasa.blob.core.windows.net/assets/The_Future_of_Work_min_f1b576cae6.jpg",
  "previewText": "The question of what the future work holds remains a complex one. But, as technology evolves, the future of work practices, workplaces, and workers is experiencing a radical shift. The type of jobs and opportunities are changing. Though it can be hard to keep up with thriving innovations, while it is impossible to say what the future will bring, there are some things we can be sure of. Nevertheless, soft skills, critical thinking, problem-solving, and teamwork abilities, in particular, will continue to be in great demand in work practices.",
  "longText": "<p>The question of what the future work holds remains a complex one. But, as technology evolves, the future of work practices, workplaces, and workers is experiencing a radical shift. The type of jobs and opportunities are changing.<br/><br/>Though it can be hard to keep up with thriving innovations, while it is impossible to say what the future will bring, there are some things we can be sure of. Nevertheless, soft skills, critical thinking, problem-solving, and teamwork abilities, in particular, will continue to be in great demand in work practices.</p><br><h5>Remote working; the future of work</h5><p>Following the unprecedented Covid-19 outbreak, which halted all physical activities, contact, business, and education all over the world. The way work was done altered dramatically, resulting in a digital transformation.<br/><br/>The future of work is remote and will probably remain so. Well, 2020 will forever remain a year of digital transformation, working took another dimension into being remote. Many businesses quickly adapted to moving their business online. Software development, digital marketing, and the tech industry as a whole became a fortune to thread on with unlimited opportunities.<br/><br/>According to Forbes, the number of people working remotely is expected to double by 2021. Looking further ahead, it is predicted that by 2025, 70% of the workforce will be working remotely. The advent of powerful tools and software solutions to improve organizational communication and collaboration became notable. You can work from home or any location and still deliver great results.</p><br><h5>The rise of social collaboration</h5><p>The rise of social collaboration in the workplace is a relatively new phenomenon and a natural development in the way we communicate and work. Many firms are using it to better their work habits and provide a more collaborative environment for their staff.<br/><br/>Knowledge sharing, improved communication, more creativity, and increased production are some of the advantages of social cooperation. Individual employees or small groups cooperate to complete tasks in a social collaboration environment. As information and ideas flow more freely, it allows for greater integration and alignment among teams. It's a technique that's become more popular and a method for allowing information to move between people seamlessly even without physical contact.</p><br><h5>AI and Robotics on the future of work</h5><p>According to the World Economic Forum's 'The Future of Jobs Report 2020,' AI is expected to replace 85 million jobs worldwide by 2025. Though that sounds frightening, the report goes on to say that it will also create 97 million new jobs during the same time period.<br/><br/>These emerging technologies will affect the future of human jobs. Although the impact of new technology on the labor market is a contentious issue, most experts agree that automation and artificial intelligence will have a substantial impact in the near future. Jobs that are currently available to humans will be taken over by machines as a result of this.<br/><br/>This may cause a slew of problems for people looking for work as well as those who have lost their jobs due to automation. And, this is due to the fact that machines can perform activities that humans can't or won't, such as repetitive work or working 24 hours a day without tiring.<br/><br/>In the future decades, technological advancement will have a significant impact on the nature of employment as well as its benefits. These are the future of work, and abruptly it is here.</p>",
  "date": "Fri. 10th Oct. 2023.",
  "authorName": "Sophie Wood",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
},
{
  "id": 5,
  "category": "Remote Work",
  "title": "Negotiating a salary – 5 tips for candidates",
  "image": "https://geriasa.blob.core.windows.net/assets/Negotiating_a_salary_5_tips_for_candidates_min_1ec5737a0e.jpg",
  "previewText": "Negotiating a salary can be a tricky business. However, armed with the right information and approach, you can increase your chances of getting the salary you deserve. Here are 5 tips for candidates to help you negotiate a salary",
  "longText": "Negotiating a salary can be a tricky business. However, armed with the right information and approach, you can increase your chances of getting the salary you deserve. Here are 5 tips for candidates to help you negotiate a salary:<br><br><h5>1. Do your research</h5><br>Before entering into negotiations, it is important to have a good understanding of the market value for your skills and experience, and know what the market rate is for your position. Use online resources, such as salary surveys and job boards, to get an idea of what you should be earning. This will give you a good starting point for negotiations.<br><br><h5>2. Be prepared to compromise</h5><br>In any negotiation, there will be some give and take. Be prepared to compromise on other aspects of the job, such as job duties, vacation days, or other benefits, in order to get the salary you want. Also know, when you're negotiating your salary, the other party is likely to ask you questions about your experience and what you're looking for. It's important to be prepared to answer these questions so that you can make the best case for yourself.<br><br><h5>3. Know your worth and bottom line</h5><br>One of the most important things to remember when negotiating your salary is to know your worth. You should have a good idea of what you bring to the table and what your skills are worth. This will help you feel confident when negotiating. It’s important to also know your bottom line – the minimum salary you are willing to accept. Once you know your bottom line, you would be more confident in your negotiations.<br><br><h5>4. Be prepared to walk away<br></h5>If you're not happy with the offer or the employer is not willing to meet your salary demands, be prepared to walk away from the negotiation. This can be a tough decision, but it is important to know your worth and stick to your guns. This shows that you're serious about getting what you're worth and that you're not afraid to stand up for yourself. It's important to be assertive when negotiating your salary. This doesn't mean being aggressive, but it does mean being firm and confident in what you're asking for.<br><br><h5>5. Use your resources<br></h5>If you are feeling stuck in negotiations, use your resources, such as a salary calculator, to help you determine a fair salary. This can be a great tool to help you get the salary you deserve. Negotiating a salary can be a daunting task, but it's important to remember that you have more power than you think."
  ,"date": "Fri. 17th Nov. 2023.",
  "authorName": "Sophie Wood",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
},
{
  "id": 6,
  "category": "Technology",
  "title": "What you should know as an immigrant tech",
  "image": "https://geriasa.blob.core.windows.net/assets/What_you_should_know_as_an_immigrant_tech_in_the_UK_min_ca001a0646.png",
  "previewText": "As an immigrant in the UK seeking a tech job, you may face challenges in such a competitive job market. Nevertheless, by utilising the correct strategies and a focused approach, you can further your chances of attaining a fantastic position. This blog post aims to help you achieve this, so read on, and learn some tips and tricks that will allow you to succeed in the tech industry.",
  "longText": "<p>As an immigrant in the UK seeking a tech job, you may face challenges in such a competitive job market. Nevertheless, by utilising the correct strategies and a focused approach, you can further your chances of attaining a fantastic position. This blog post aims to help you achieve this, so read on, and learn some tips and tricks that will allow you to succeed in the tech industry.</p><h5>Research the UK tech industry – dedicate time to understand</h5><p>Before you dive into your job search, dedicate time to carefully research the UK tech industry. It’s beneficial to understand information such as the current trends, the in-demand skills that employers want, and new technologies. This knowledge will provide you the ability to showcase your expertise and skill set appropriately.</p><h5>Refine Your CV and Cover Letter</h5><p>Ensure that your CV and cover letter highlight the relevant skills, experience, and achievements needed for the role. Showcase skills that can be transferable and explain how they fit with the job requirements. Customising your application materials will help you stand out amongst other candidates and get noticed by recruiters.</p><h5>Utilise Online Professional Networks (like LinkedIn)</h5><p>Take advantage of professional networking platforms like Linkedin to connect with tech industry professionals and potential employers. Partake in tech communities and groups, join discussions, and exemplify your skills through these contributions. Networking, especially on popular platforms such as Linkedin, can give you rare opportunities and provide hidden insights into the tech job market.</p><h5>Gain Experience and Certifications - through internship jobs, voluntary work, part-time.</h5><p>Don’t just delve into the job market without any prior experience; consider applying for internships to start you off, voluntary work, or even part-time jobs that can build your experience and professional network. Furthermore, earning relevant certifications can evidence your commitment to career growth and supplement your credibility amongst employers.</p><h5>Keep Informed About Industry News/Events</h5><p>Whenever possible, attend tech events, seminars, or conferences to keep updated on the latest trends, creations, and networking opportunities. By participating in these events, it shows your enthusiasm for learning more and industry involvement. This makes you a more appealing candidate to possible employers.</p><h5>Contact Organisations Supporting Immigrants</h5><p>Don’t be afraid to seek support; search for support organisations that assist immigrants in the UK job market. Such organisations can supply resources, one-to-one guidance, and further mentorship to help you steer your job search process effectively.</p><p>Attaining a tech job as an immigrant in the UK may need additional effort, but with a well-thought out plan and determination, you can reach success. Use the tips in this blog to cement your position in the tech world. Your diverse background is a positive asset in the British tech industry, so utilise your experience to accelerate your career forwards. Good luck!</p>",
  "date": "Mon. 20th Nov. 2023.",
  "authorName": "Sophie Wood",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
},
{
  "id": 7,
  "category": "Hiring",
  "title": "Outsourcing vs Outstaffing, which is right for you?",
  "image": "https://geriasa.blob.core.windows.net/assets/yes_55e2aeb830.jpg",
  "previewText": "The growing wave of digitization and digitalization has resulted in a critical talent gap in the UK. If not addressed, much of the potential of digitalization could go unrealized. According to Consultancy.uk, the UK stands the risk of forgoing more than £140 billion if the status quo remains. Let’s start with the definition of these terms.In the simplest form, outsourcing happens when a company hires another company to carry out planned or existing business activity. In the technology space, this often takes the form of software development",
  "longText": "<p>The growing wave of digitization and digitalization has resulted in a critical talent gap in the UK. If not addressed, much of the potential of digitalization could go unrealized.</p><p>According to <a href=\"https://www.consultancy.uk/\" target=\"_blank\" style=\"color: blue;\">Consultancy.uk</a>, the UK stands the risk of forgoing more than £140 billion if the status quo remains.</p><p>Let’s start with the definition of these terms.</p><br><h5>Outsourcing</h5><p>In the simplest form, outsourcing happens when a company hires another company to carry out planned or existing business activity. In the technology space, this often takes the form of software development. Here, your vendor bears the responsibility of delivering the project and manages the end-to-end project flow. When finished, the product is delivered to you, tested and approved.</p><br><h5>Outstaffing</h5><p>Here, you hire an individual or a team of professionals to work as embedded members of your team under your supervision. In most cases, they work remotely. You have full control here and determine the work flow direction. The outstaffing vendor takes the critical role of finding, hiring, and handling all administrative duties. While the employee’s payroll and taxes are handled by your vendor, the employee works directly with you.</p><br><h5>Cost</h5><p>Smart organizations often look for ways of remaining competitive, especially in periods of uncertainty and instability, like the imminent recession is about to plunge us into. Organizations are increasingly turning to these models to utilize available resources optimally and reduce cost.</p><br><h5>Remote mindset</h5><p>The global pandemic has accelerated our transition to remote work. Research studies show a positive correlation between remote work and productivity, indicating that organizations are likely to maintain the remote culture after the global lockdown due to the inherent advantages.</p><br><h5>Benefits of outsourcing and Outstaffing</h5><p><strong>Cost savings</strong></p><p>Outsourcing to a country with lower cost of living translates to significant cost savings. Lower salaries, production, infrastructure, and operational costs mean the vendor will charge much less than another vendor in high-cost markets.</p><p><strong>Time savings</strong></p><p>With an outsourcing partner, you don’t waste time in hiring, onboarding, and training new staff members. You simply hire the vendor, who uses his existing, often experienced team to deliver your project. As you know, time is money.</p><p><strong>Scaling fast</strong></p><p>When you outsource some or all elements of your development, you free up time to focus on acquiring new clients and entering new markets, without scaling your internal operation.</p><p><strong>Access to global talent pool</strong></p><p>With the increasing shortage in tech talents in the UK, outsourcing and outstaffing models are a strategy to access the hard-to-find and expensive skills set in the local market. In addition, employing the outsourcing model increases your organization’s diversity quotient.</p><br><h5>Concerns of outsourcing</h5><p><strong>Time difference</strong></p><p>This can be a major challenge if you are not in similar time zones with your outsourcing vendor. There could be a significant dent in the communication flow which could affect the overall success of the project.</p><p><strong>Language barrier</strong></p><p>Communication flow could be hampered significantly if your partner vendor struggles with your major language of communication. This often leads to wasted time and misinterpretation of the project requirements.</p><p><strong>Culture and work habits</strong></p><p>Different environments elicit different cultural norms and work habits. For example, for some hierarchical cultures, reports often do the bidding of the superiors, with no questions asked. Training and retraining go a long way in filling the missing gaps here.</p><p><strong>Privacy and security concerns</strong></p><p>From afar, this may look like a huge concern. On a close look, one discovers that the challenges can easily be mitigated. With the outstaffing model, the contracting company has total control on the access granted to the embedded staff just as other staff members. Also, engagements on the outsourcing model typically come with intellectual property protection.</p></br><h5>What option do I go for?</h5><p>Outstaffing model is ideal in situations where you have the required expertise in-house but lack the development capacity. You may have a CTO, who is responsible for your development strategy and is particular about the architectural consistency of your software component but needs some additional hands. To overcome the capacity challenge, you could either go for an embedded team member or a team extension — depending on the capacity gap.</p><p>Outsourcing is better suited for situations where you do not have the in-house expertise and are not able to build your IT team yet either due to a constrained budget or other reasons. In this case, you could have a measurable part or your entire project built out by the outsourced vendor.</p><p>If you are looking for a partner that understands how to recruit and onboard overseas talents for full-time or part-time positions, hit us up at Geria. We take care of all the recruitment and overhead responsibilities and ensure the right candidate is embedded into your team while you focus on building that awesome product!</p><br><p>Photo credit: skydiv</p>",
  "date": "Tue. 28th Nov. 2023.",
  "authorName": "Sophie Wood",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/female_avatar_ca3d045095.webp"
},
{
  "id": 8,
  "category": "Hiring",
  "title": "How to Build Effectively",
  "image": "https://geriasa.blob.core.windows.net/assets/blueprint.jpg",
  "previewText": "In this blog we are going to discuss two approaches to feature development. Horizontal delivery and vertical delivery.",
  "date": "Fri. 14th Feb. 2025.",
  "authorName": "Amy Hanuma",
  "authorAvatarUrl": "https://geriasa.blob.core.windows.net/assets/portrait1.jpg",
  "longText": "<div><h2>Ask yourself these questions:</h2><p>Is your team always busy but your users aren’t seeing any new features?</p><p>Have you ever worked hard on a feature only to be disappointed when you learn your users aren’t using it?</p><br><h2>Topic and purpose of this blog</h2><p>Today I want to help evaluate how we tackle our work when implementing features for your project.</p><p>In this blog we are going to discuss two approaches to feature development. Horizontal delivery and verticaldelivery.</p><p><b>Vertical Delivery:</b> This approach focuses on delivering complete, functional slices of a product that cutacross all necessary layers—UI, backend, and database. Each increment provides real user value and can be testedend-to-end. This method aligns well with agile principles, allowing for faster feedback and iteration.</p><p><b>Horizontal Delivery:</b>This method builds software layer by layer, such as developing the entire databaseschema first, then the backend, and finally the UI. While it might seem organized, it often leads to delayedintegration, increased rework, and a lack of early user feedback.</p><br><h3>A Short Story</h3><p>Say we are building a travel app, and you have a vision for how this app should look like. You might want thefollowing features:</p><ul className={\"list-disc list-inside\"}><li>A map to see taxis nearby</li><li>A list of reviews for restaurants nearby </li></ul><p>When your development team picks up these features, they realized that the location/tracking functionality inthe Api and Database can be shared across both features.So, your first sprint towards this goal is aimed at implementing this functionality in your service and databaselayer. By the end of the sprint, you have integration test cases that look a bit like:</p><ul className=\"list-disc list-inside\"><li>‘Find all taxis method should return all taxis within specified area’</li><li>‘Find all restaurants method should return all restaurants within specified area’</li></ul><p>You start to feel good because it feels like you’re accomplishing something. As you worked on multiple featuresthis sprint there simply wasn’t enough time to focus on the UI, so you will have to tackle it in the nextsprint.</p><br><h5>The problem</h5><p>By focusing on how to develop all the features efficiently, we have broken some important agile principles!Agile principle no. 1:“Our highest priority is to satisfy the customerthrough early and continuous deliveryof valuable software.”In the first sprint we didn’t deliver anything a user could use and therefore our clients received no value.From a business perspective, it could mean we convert fewer clients.Agile principle no. 10:“Simplicity--the art of maximizing the amountof work not done--is essential.”By delaying instant feedback from the client. We become less confident that what we are building is of realvalue. That feedback is important because it can allow us to stop wasting time on irrelevant features and pivottowards more valuable ones.</p><br><h3>Introducing Vertical Delivery (The Solution)</h3><p>‘Vertically delivery’ is developing a feature that a customer can use in a single sprint.The work being done must only focus on the feature and nothing else. There can be no scope creep. Remember the10th Agile principle. You are trying to maximize the work not done.In practice this will mean the development of the feature may touch multiple layers of an application, that maybe the database, the API & the UI etc. Because you are integrating between the layers early on, you can addressany integration issues immediately. With vertical delivery it could be weeks before you realize your UI and APIdon’t integrate well, further delaying your feature.The feature may or may not require more features be truly useful. However, this a piece of the system that canwork on its own and importantly give value and receive feedback straight away.</p><br><h3>In summary you can expect:</h3><ul><li>Faster time to market</li><li>Better integration of tech stacklayers</li><li>Improved customer feedback loops</li></ul></div>"
}
  ]
}
